backend/services/messaging-service/tests/performance/load-test.yml
config:
  target: "http://localhost:5005"
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Warm up"
    - duration: 60
      arrivalRate: 20
      name: "Load test"
    - duration: 30
      arrivalRate: 40
      name: "Stress test"
  defaults:
    headers:
      Content-Type: "application/json"
      Authorization: "Bearer {{ $env.LOAD_TEST_TOKEN }}"

scenarios:
  - name: "Get Conversations"
    weight: 50
    flow:
      - get:
          url: "/api/conversations"
          expect:
            - statusCode:
                - 200
                - 401

  - name: "Send Message"
    weight: 30
    flow:
      - post:
          url: "/api/messages"
          json:
            conversationId: "{{ $env.LOAD_TEST_CONV_ID }}"
            content: "Performance test message {{ $randomString() }}"
          expect:
            - statusCode:
                - 201
                - 400
                - 401
                - 403
                - 404

  - name: "Get Messages in Conversation"
    weight: 10
    flow:
      - get:
          url: "/api/messages/{{ $env.LOAD_TEST_CONV_ID }}"
          expect:
            - statusCode:
                - 200
                - 401
                - 404

  - name: "Health Check"
    weight: 10
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200